# Built In Failures Rebar Failures Crank Type Was Deleted Property

Source: https://www.revitapidocs.com/2026/464db35e-e10b-8656-4e7e-87bc3bcc2105.htm

---

| Built In Failures Rebar Failures Crank Type Was Deleted Property |
| --- |

Crank type was deleted.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static FailureDefinitionId CrankTypeWasDeleted { get; }
```

```
Public Shared ReadOnly Property CrankTypeWasDeleted As FailureDefinitionId
	Get
```

```
public:
static property FailureDefinitionId^ CrankTypeWasDeleted {
	FailureDefinitionId^ get ();
}
```

```
static member CrankTypeWasDeleted : FailureDefinitionId with get
```

#### Property Value

FailureDefinitionId See Also

#### Reference

BuiltInFailures RebarFailures Class Autodesk.Revit.DB Namespace